[
  {
    "Constellation Name": "Andromeda",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Andromeda is located in the northern sky, best visible during autumn evenings in the Northern Hemisphere. It lies along the celestial equator, making it observable from most of the world, between latitudes +90° and -40°. It borders the constellations Pegasus, Perseus, Cassiopeia, Lacerta, and Pisces. Its most recognizable feature is the \"Andromeda Chain\" of stars stretching from Pegasus. It covers 722 square degrees, ranking it 19th in size.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Andromeda derives its name from Greek mythology. She was the daughter of King Cepheus and Queen Cassiopeia of Ethiopia. Cassiopeia's vanity angered Poseidon, who sent a sea monster, Cetus, to attack their kingdom. To appease the gods, Andromeda was chained to a rock as a sacrifice but was saved by Perseus, who killed the monster. The constellation is part of the Perseus family, with many related constellations nearby, such as Cepheus and Cassiopeia.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpheratz (Alpha Andromedae): The brightest star in Andromeda, a blue-white subgiant. It is part of the Great Square of Pegasus and located 97 light-years away. Alpheratz is a binary system. \n\n Mirach (Beta Andromedae): A red giant star, 197 light-years away. Mirach is often used as a guide star for locating nearby deep-sky objects such as galaxies. \n\n Almach (Gamma Andromedae): A triple star system. Its primary star is golden-yellow, and its companion stars appear bluish. Almach is located 350 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Andromeda Galaxy (M31): The largest galaxy in the Local Group, located 2.5 million light-years away. It is visible to the naked eye as a faint oval smudge under dark skies. \n\n M32 and M110: These are satellite galaxies of M31. M32 is a compact elliptical galaxy, while M110 is a dwarf elliptical galaxy visible with small telescopes. \n\n NGC 891: An edge-on spiral galaxy about 30 million light-years away. Its resemblance to the Milky Way makes it a popular target for astrophotography.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "While Andromeda is not associated with any major annual meteor showers, the Andromedids, a minor meteor shower originating from comet 3D/Biela, occur sporadically in late November and early December. The shower’s activity has significantly diminished in modern times.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Andromeda is best observed under dark skies away from city lights. Start by locating the Great Square of Pegasus in the northeastern sky during fall evenings. From the upper-left corner of the square (star Alpheratz), trace a chain of stars extending outward to locate the constellation. The Andromeda Galaxy (M31) is visible to the naked eye in dark skies as a faint smudge. Binoculars or small telescopes enhance the view, revealing its elongated shape and bright core. Alpheratz, Mirach, and Almach serve as useful reference points when navigating the constellation.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "The Andromeda Galaxy (M31) is crucial for understanding galactic formation, evolution, and dynamics. As the largest galaxy in the Local Group, it provides a comparative model for the Milky Way. It is on a collision course with our galaxy, expected to merge in approximately 4.5 billion years. Andromeda’s variable stars, including Cepheid variables, have been instrumental in refining the cosmic distance scale. The constellation also hosts systems that help study stellar evolution and galaxy interactions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Andromeda.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Antilia",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Antlia, the \"Air Pump,\" is a faint constellation in the Southern Hemisphere. It lies between the constellations Hydra, Pyxis, and Vela. Best observed in late winter and spring in the Southern Hemisphere, it is visible between latitudes +45° and -90°. Covering 239 square degrees, it ranks 62nd in size among the 88 constellations.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Antlia is one of the modern constellations introduced by French astronomer Nicolas-Louis de Lacaille in the 18th century. It represents the air pump, a scientific instrument invented by Robert Boyle. Unlike many constellations, Antlia does not have roots in ancient mythology but instead commemorates advancements in science during the Age of Enlightenment.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Antliae: The brightest star in Antlia, a red giant located approximately 365 light-years away, with an apparent magnitude of 4.28. \n\n Epsilon Antliae: A yellow giant star located about 700 light-years away, shining at magnitude 4.51. \n\n Delta Antliae: A binary star system consisting of two closely orbiting stars, visible with small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 2997: A grand-design spiral galaxy located about 40 million light-years away, featuring a bright nucleus and prominent spiral arms. It is a popular target for astrophotographers. \n\n Antlia Cluster: A group of over 200 galaxies located approximately 130 million light-years away. It is one of the closest galaxy clusters to Earth.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Antlia.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Antlia is faint and challenging to observe without a dark sky. Use the nearby constellations Hydra and Vela as references to locate it in the southeastern sky during late winter and early spring. A star chart or app will help pinpoint its faint stars. Binoculars or small telescopes are recommended for viewing its notable deep-sky objects, such as the Antlia Cluster and NGC 2997.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Antlia hosts the Antlia Cluster, an important region for studying the large-scale structure of the universe and galaxy interactions. NGC 2997 provides insights into the dynamics of spiral galaxies. Though faint, the constellation holds significance for astrophotographers and researchers focusing on galaxy clusters and dark matter.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Inage",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Antlia.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Apus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Apus, the \"Bird of Paradise,\" is a small constellation located in the Southern Hemisphere. It is best observed in the evening during late spring and summer (June to August) in the Southern Hemisphere. Apus lies between the constellations Octans, Triangulum Australe, and Pavo. It is visible at latitudes between +5° and -90° and covers an area of 206 square degrees, ranking 67th in size.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Apus is one of the 12 constellations introduced by Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents the bird of paradise, an exotic bird from New Guinea that was highly prized in Europe during the Age of Exploration. It has no roots in classical mythology, as it was named to reflect the flora and fauna discovered during European voyages.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Apodis: The brightest star in Apus, an orange giant located approximately 411 light-years away, with an apparent magnitude of 3.83. \n\n Gamma Apodis: A yellow giant star, approximately 160 light-years away, with a magnitude of 3.87. \n\n Delta Apodis: A red giant, approximately 760 light-years away, notable for its variability and deep red coloration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 6101: A globular cluster located approximately 47,600 light-years away, with a magnitude of 9.2. It is faint but observable with small telescopes. \n\n IC 4633: A reflection nebula located in the same region, requiring larger telescopes to observe clearly.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Apus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Apus is faint and best observed from a dark sky location in the Southern Hemisphere. Look for the nearby bright constellation Triangulum Australe as a reference point. Apus lies west of Triangulum Australe and south of Pavo. Use a star chart or app to locate its faint stars. Binoculars or a small telescope are recommended for viewing its globular cluster, NGC 6101.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Apus is primarily of interest to astronomers for its globular cluster NGC 6101, which offers insights into the structure and evolution of globular clusters. The constellation is also significant for mapping the southern celestial hemisphere during astronomical surveys.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Apus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Aquilia",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Aquila, the \"Eagle,\" is located in the celestial equator region and is visible in both hemispheres. It is best observed in the summer months (July to September) in the Northern Hemisphere. It is bordered by the constellations Sagitta, Hercules, Serpens Cauda, Scutum, and Capricornus. Aquila spans 652 square degrees, making it the 22nd largest constellation. It is visible between +90° and -75° latitudes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "In Greek mythology, Aquila represents the eagle of Zeus, who carried his thunderbolts and abducted the Trojan prince Ganymede to serve as the cupbearer of the gods. The constellation has also been associated with the eagle that guarded the arrows of Eros in Roman myths. Its connection to the heavens as a symbol of strength and divine authority is significant in various cultures.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Altair (Alpha Aquilae): The brightest star in Aquila, a white main-sequence star located approximately 16.7 light-years away, with a magnitude of 0.77. It forms the Summer Triangle along with Vega and Deneb. \n\n Alshain (Beta Aquilae): A yellow subgiant located about 45 light-years away, with a magnitude of 3.71. \n\n Tarazed (Gamma Aquilae): An orange giant located about 460 light-years away, with a magnitude of 2.72.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 6709: An open star cluster located about 3,000 light-years away, visible with binoculars or small telescopes. \n\n NGC 6755: Another open cluster containing around 50 stars, located approximately 4,500 light-years away. \n\n Barnard's E (B143 and B144): A striking dark nebula located near Altair, visible in wide-field astrophotography.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "June Aquilids: A minor meteor shower peaking in late June. Best viewed under dark skies with minimal light pollution. Focus on Aquila in the late evening and early morning near its peak. \n\n Epsilon Aquilids: Occurs in early May and is best viewed after midnight when the radiant is higher in the eastern sky. Both showers require patience and are best observed with eyes adapted to the dark.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Aquila is easy to locate due to its brightest star, Altair, which forms the Summer Triangle along with Vega (in Lyra) and Deneb (in Cygnus). Look for Altair in the eastern sky during summer evenings. Aquila's stars form an elongated diamond or \"T\"-shape extending southward from Altair. Under dark skies, its location along the Milky Way band makes it even easier to spot. Binoculars or small telescopes will enhance the view of deep-sky objects like NGC 6709 and the dark nebula Barnard's E.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Aquila is home to Altair, one of the closest and brightest stars, which rotates rapidly, providing data on stellar physics and flattening due to rotation. Its dark nebulae, such as Barnard's E, offer insights into interstellar dust and gas. Aquila's location along the Milky Way makes it a rich field for studying star clusters, nebulae, and stellar evolution.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Aquila.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Ara",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Ara, the \"Altar,\" is a southern constellation located near the Milky Way. It is best observed during winter in the Southern Hemisphere (June to August) and is visible at latitudes between +25° and -90°. It is bordered by the constellations Scorpius, Triangulum Australe, Norma, and Pavo. Ara covers an area of 237 square degrees, ranking it 63rd in size among the 88 constellations.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Ara is one of the ancient constellations listed by the Greek astronomer Ptolemy. It represents the altar upon which the gods swore their allegiance before battling the Titans. In Greek mythology, it is associated with the story of Zeus and his lightning bolts, forged on this altar by Hephaestus and Cyclopes. It symbolizes sacrifice and divine strength.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Beta Arae: The brightest star in Ara, an orange giant located approximately 603 light-years away, with an apparent magnitude of 2.84. \n\n Alpha Arae: A blue-white star located about 270 light-years away, notable for its rapid rotation and magnitude of 2.95. \n\n Gamma Arae: A hot blue supergiant, located about 1,140 light-years away, shining at magnitude 3.34.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 6193: An open star cluster located approximately 4,200 light-years away, associated with the emission nebula NGC 6188. \n\n NGC 6397: One of the closest globular clusters to Earth, located about 7,200 light-years away, and visible with binoculars. \n\n NGC 6164-65: A bipolar nebula formed by a massive star, offering striking visuals in astrophotography.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Ara.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Ara is best viewed from the Southern Hemisphere during the winter months, under dark skies. Its brightest stars, Beta Arae and Alpha Arae, form a distinct trapezoid-like shape near the Milky Way. To locate Ara, start with the nearby bright constellation Scorpius, and look southward toward the dense star fields of the Milky Way. Binoculars or a small telescope will enhance views of Ara’s globular cluster NGC 6397 and emission nebulae.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Ara lies near the Milky Way, making it a region rich in deep-sky objects and a target for studying star clusters and nebulae. The globular cluster NGC 6397 is of particular importance in studies of stellar evolution due to its proximity and age. The emission nebulae and star clusters within Ara are also key targets for astrophotographers and astronomers studying star formation and interstellar matter.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Ara.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Aries",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Aries, the \"Ram,\" is located in the Northern Hemisphere. It is best observed during fall and early winter (October to December). The constellation lies between Pisces to the west and Taurus to the east. Aries spans 441 square degrees, ranking it 39th in size among the 88 constellations. It is visible at latitudes between +90° and -60°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Aries represents the golden ram from Greek mythology. The ram's golden fleece was sought by Jason and the Argonauts in their epic quest. The story symbolizes bravery and determination. In Babylonian culture, Aries was associated with the agrarian calendar, marking the start of the zodiac year. It has also been a symbol of renewal and rebirth in various ancient traditions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Hamal (Alpha Arietis): The brightest star in Aries, a giant star located about 66 light-years away, with a magnitude of 2.0. \n\n Sheratan (Beta Arietis): A binary star system located approximately 59 light-years away, with a magnitude of 2.64. \n\n Mesarthim (Gamma Arietis): A binary star system often referred to as the “first double star” discovered telescopically.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 772: A spiral galaxy located approximately 130 million light-years away, visible with mid-sized telescopes. \n\n NGC 1156: A dwarf irregular galaxy located about 25 million light-years away. \n\n The Aries Cloud: A loose grouping of galaxies found in the constellation, ideal for study with larger telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Delta Arietids: A minor meteor shower that peaks in mid-December. \n\n Observation Tips: Best viewed after midnight under dark skies during its peak. The radiant point lies near Aries’ brightest stars, Hamal and Sheratan, making them useful reference points for observing meteors. Allow your eyes to adjust to the dark for at least 20–30 minutes for optimal results.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Aries is easy to locate due to its two brightest stars, Hamal and Sheratan, which form a distinctive curve in the sky. To find Aries, locate the \"V\"-shaped Hyades cluster in Taurus, then shift westward. Aries’ stars form a simple, linear pattern near the ecliptic. Use a star chart or an app to refine your search. The best viewing time is from October to December, when Aries is high in the night sky.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Aries’ location along the ecliptic makes it important for tracking planetary motions and lunar positions. Historically, the vernal equinox (the point where the Sun crosses the celestial equator) was located in Aries, although it has since shifted to Pisces due to precession. The constellation’s binary stars, such as Mesarthim, are of interest to astronomers studying stellar dynamics and evolution.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Aries.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Auriga",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Auriga, the \"Charioteer,\" is located in the Northern Hemisphere. It is best observed during winter evenings (December to February). The constellation is bordered by Perseus, Taurus, Gemini, and Lynx. Auriga spans 657 square degrees, ranking it 21st in size among the 88 constellations. It is visible at latitudes between +90° and -40°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "In Greek mythology, Auriga is associated with a charioteer, sometimes identified as Erichthonius of Athens, a king credited with inventing the chariot. It is also connected to Hephaestus, the god of fire, and the goat Amalthea, who nourished Zeus in infancy. The prominent star Capella is often associated with Amalthea, adding to the constellation's rich mythological symbolism.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Capella (Alpha Aurigae): The brightest star in Auriga and the sixth brightest in the night sky. It is a yellow giant located about 42.9 light-years away. \n\n Menkalinan (Beta Aurigae): A binary star system located about 85 light-years away, with a magnitude of 1.90. \n\n Elnath (Gamma Aurigae): Shared with Taurus, it is a blue-white giant with a magnitude of 1.65.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 36 (M36): An open star cluster located approximately 4,100 light-years away. Visible with binoculars or small telescopes. \n\n Messier 37 (M37): The richest open cluster in Auriga, located about 4,500 light-years away. \n\n Messier 38 (M38): Another open cluster about 4,200 light-years away, often referred to as the \"Starfish Cluster\" due to its shape.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Aurigids: A minor meteor shower that peaks in late August. \n\n Observation Tips: Best viewed in the early morning hours when Auriga is high in the sky. The radiant point lies near Capella, so focus your gaze in that direction. Find a dark location and allow your eyes to adjust to the dark for 20–30 minutes for optimal viewing.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Auriga is easy to locate thanks to Capella, one of the brightest stars in the night sky. Look for a hexagonal shape in the northeastern sky during winter evenings. Use binoculars or small telescopes to observe its rich star clusters, such as M36, M37, and M38. The best time to observe Auriga is from December to February, when it is high in the sky during early evening hours.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Auriga contains three Messier objects (M36, M37, and M38), which are important for studying star cluster dynamics and evolution. Its brightest star, Capella, is a spectroscopic binary system and one of the most studied stars due to its proximity and brightness. The constellation’s location along the Milky Way also makes it a rich area for observing deep-sky objects.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Auriga.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Boötes",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Boötes, the \"Herdsman,\" is located in the Northern Hemisphere. It is best observed during spring and early summer (April to June). The constellation is bordered by Ursa Major, Virgo, Corona Borealis, and Serpens Caput. Boötes spans 907 square degrees, ranking it 13th in size. It is visible at latitudes between +90° and -50°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Boötes represents a herdsman or plowman in Greek mythology, often associated with Arcas, the son of Zeus and Callisto. According to legend, he invented the plow and was placed in the sky to honor his contributions to agriculture. The name \"Boötes\" translates to \"ox-driver,\" further emphasizing his connection to farming and the stars.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Arcturus (Alpha Boötis): The brightest star in Boötes and the fourth brightest in the night sky, an orange giant located about 36.7 light-years away. \n\n Nekkar (Beta Boötis): A yellow giant located approximately 219 light-years away, with a magnitude of 3.49. \n\n Izar (Epsilon Boötis): A beautiful double star system, consisting of a bright orange giant and a faint blue dwarf.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 5466: A globular cluster located about 52,000 light-years away, visible with small telescopes. \n\n Arp 286: A group of interacting galaxies located approximately 90 million light-years away. \n\n The Boötes Void: A vast region in space nearly devoid of galaxies, a mystery that challenges our understanding of the universe’s structure.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Quadrantids: A major meteor shower that peaks in early January. \n\n Observation Tips: The radiant point is near the northeastern horizon, close to the handle of the Big Dipper (part of Ursa Major). Best viewed during the early morning hours after midnight. Dress warmly and plan for sustained observation to catch its bright meteors.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Boötes is easy to locate due to Arcturus, its brightest star. Follow the arc of the Big Dipper's handle to \"arc to Arcturus\" in the southeastern sky during spring evenings. The constellation's kite-shaped pattern is distinctive. Binoculars or a small telescope are useful for observing its double stars and globular clusters.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Boötes is home to Arcturus, one of the brightest and closest stars, studied extensively for its evolutionary state as a giant star. The Boötes Void is a focal point for understanding cosmic voids and large-scale structure in the universe. The constellation’s double stars, like Izar, offer valuable opportunities to study binary star systems.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Bootes.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Caelum",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Caelum, the \"Chisel,\" is a small constellation in the Southern Hemisphere. It is best observed in summer and early fall (December to February). The constellation is bordered by Columba, Lepus, Pictor, and Eridanus. Caelum spans 125 square degrees, ranking it 81st in size among the 88 constellations. It is visible at latitudes between +40° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Caelum was introduced in the 18th century by French astronomer Nicolas-Louis de Lacaille. It represents a sculptor’s chisel, symbolizing creativity and artistic skill. Unlike many constellations, Caelum has no roots in ancient mythology and instead reflects Enlightenment-era interests in science and the arts.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Caeli: A yellow-white main-sequence star located about 65 light-years away, with a magnitude of 4.44. \n\n Gamma Caeli: A double star system consisting of an orange giant and a smaller companion, located approximately 185 light-years away. \n\n Beta Caeli: A white subgiant located about 90 light-years away, with a magnitude of 5.04.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 1679: A barred spiral galaxy located about 60 million light-years away, visible with mid-sized telescopes. \n\n HE0450-2958: A unique quasar system exhibiting unusual behavior, studied for its insights into galaxy formation.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Caelum.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Caelum is faint and challenging to observe without dark skies. Locate it using nearby bright constellations like Lepus and Columba as guides. A star chart or app will assist in pinpointing its dim stars. Binoculars or small telescopes are recommended for observing its galaxy NGC 1679 or its interesting double star system, Gamma Caeli.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Caelum is of interest primarily for its unique deep-sky objects, like the quasar HE0450-2958, which has been studied for its implications on galaxy formation and evolution. Its faint stars and compact size make it a less prominent constellation but still valuable for astronomers conducting surveys of the Southern Hemisphere.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "",
    "Details": "",
    "Image": ""
  },
  {
    "Constellation Name": "Camelopardalis",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Camelopardalis, the \"Giraffe,\" is a large but faint constellation in the Northern Hemisphere. It is best observed during winter evenings (December to February). It is bordered by Draco, Ursa Major, Cassiopeia, and Perseus. Camelopardalis spans 757 square degrees, ranking it 18th in size among the 88 constellations. It is visible at latitudes between +90° and -10°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Caelum.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Cancer",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Cancer, the \"Crab,\" is a zodiac constellation located in the Northern Hemisphere. It is best observed during spring evenings (March to May). The constellation lies between Gemini to the west and Leo to the east. Cancer spans 506 square degrees, ranking it 31st in size among the 88 constellations. It is visible at latitudes between +90° and -60°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "In Greek mythology, Cancer represents the crab sent by Hera to distract Heracles during his battle with the Hydra. Heracles crushed the crab, but Hera placed it in the sky as a reward. The constellation's dim stars reflect the crab's small size and minor role in the myth.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Beta Cancri (Tarf): The brightest star in Cancer, an orange giant located about 290 light-years away, with a magnitude of 3.5. \n\n Delta Cancri: A red giant star, notable for being near the open cluster Messier 67. \n\n Alpha Cancri (Acubens): A binary star system located approximately 174 light-years away, with a combined magnitude of 4.26.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 44 (Beehive Cluster): A prominent open cluster located about 610 light-years away, visible to the naked eye as a fuzzy patch. \n\n Messier 67: One of the oldest known open clusters, located approximately 2,700 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Delta Cancrids: A minor meteor shower peaking in mid-January. \n\n Observation Tips: Best viewed after midnight during its peak, with the radiant point near Cancer's brightest stars, Tarf and Acubens. Look for meteors radiating from the eastern sky under dark conditions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Cancer is faint but easy to find between the bright constellations Gemini and Leo. Use the Beehive Cluster (M44) as a guide—it appears as a faint, hazy patch to the naked eye under dark skies. Binoculars or a small telescope enhance views of M44 and M67. The best time to observe Cancer is during spring evenings, when it is high in the sky.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Cancer’s Beehive Cluster (M44) is a prominent target for studying star cluster formation and dynamics. Messier 67, being one of the oldest open clusters, provides insights into stellar aging and evolution. The constellation’s position along the zodiac also makes it important for tracking planetary and lunar motions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Cancer.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Canes Venatici",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Canes Venatici, the \"Hunting Dogs,\" is a small constellation in the Northern Hemisphere. It is best observed during spring evenings (April to June). It is bordered by Ursa Major, Boötes, and Coma Berenices. Canes Venatici spans 465 square degrees, ranking it 38th in size among the 88 constellations. It is visible at latitudes between +90° and -40°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Canes Venatici was introduced by Polish astronomer Johannes Hevelius in the 17th century. It represents the hunting dogs of Boötes, traditionally named Asterion and Chara. The constellation has no roots in ancient mythology but complements Boötes in its role as a herdsman and hunter.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Cor Caroli (Alpha Canum Venaticorum): The brightest star in Canes Venatici, a binary system with a primary star that is a magnetic chemically peculiar star. It is located about 110 light-years away and has a magnitude of 2.89. \n\n La Superba (Y CVn): A red giant carbon star, notable for its deep red color, located approximately 710 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 51 (Whirlpool Galaxy): A stunning spiral galaxy located about 31 million light-years away, visible in small telescopes. \n\n Messier 63 (Sunflower Galaxy): A flocculent spiral galaxy located approximately 27 million light-years away. \n\n NGC 4449: An irregular galaxy located about 12 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Canes Venatici.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Canes Venatici is faint but easy to locate beneath the handle of the Big Dipper in Ursa Major. Use Cor Caroli, its brightest star, as a guide. The constellation’s notable galaxies, such as the Whirlpool Galaxy (M51) and Sunflower Galaxy (M63), can be observed with small to medium telescopes. Spring evenings provide the best viewing conditions for this constellation.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Canes Venatici hosts several prominent galaxies, including Messier 51 (Whirlpool Galaxy), which serves as a benchmark for understanding spiral galaxy structure and interactions. The presence of La Superba, a bright carbon star, makes the constellation an important target for studying late stellar evolution and carbon-rich atmospheres.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Canes%20Venatici.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Canis Major",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Canis Major, the \"Greater Dog,\" is a prominent constellation in the Southern Hemisphere, visible during winter evenings (December to March). It is bordered by Monoceros, Lepus, and Puppis. Canis Major spans 380 square degrees, ranking it 43rd in size among the 88 constellations. It is visible at latitudes between +60° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Canis Major represents one of Orion’s hunting dogs in Greek mythology, often associated with the bright star Sirius, known as the \"Dog Star.\" The constellation symbolizes loyalty and hunting prowess. In various cultures, Sirius has been a symbol of the heat of summer due to its appearance during the \"dog days.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Sirius (Alpha Canis Majoris): The brightest star in the night sky, a white main-sequence star located 8.6 light-years away, with a magnitude of -1.46. \n\n Adhara (Epsilon Canis Majoris): A blue supergiant star located about 430 light-years away, with a magnitude of 1.5. \n\n Wezen (Delta Canis Majoris): A yellow-white supergiant located approximately 1,600 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 41 (M41): An open cluster located about 2,300 light-years away, visible with binoculars or small telescopes. \n\n NGC 2359 (Thor's Helmet): An emission nebula shaped like a Viking helmet, located approximately 15,000 light-years away. \n\n NGC 2207 and IC 2163: A pair of interacting galaxies located about 80 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Canis Major.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Canis Major is easy to locate due to Sirius, the brightest star in the night sky. Look for Sirius in the southeastern sky during winter evenings, below and to the left of Orion’s Belt. The constellation forms a stick-figure dog shape, with Sirius marking its head. Binoculars or small telescopes can enhance views of its deep-sky objects like M41 and Thor's Helmet Nebula.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Canis Major hosts Sirius, a key star for studying stellar properties and binary systems due to its proximity. The interacting galaxies NGC 2207 and IC 2163 are important for understanding galaxy collisions and evolution. Thor's Helmet is a prime target for studying massive stars and their surrounding nebulae.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Canis%20Major.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Canis Minor",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Canis Minor, the \"Lesser Dog,\" is a small constellation located in the Northern Hemisphere. It is best observed during winter evenings (December to March). It is bordered by Monoceros, Gemini, and Hydra. Canis Minor spans 183 square degrees, ranking it 71st in size among the 88 constellations. It is visible at latitudes between +90° and -75°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Canis Minor represents one of Orion’s hunting dogs in Greek mythology, often paired with Canis Major. It is also associated with the loyal dog Maera, who alerted its master to a tragedy in Greek lore. The constellation has had various symbolic roles in different cultures, including representing small but faithful companions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Procyon (Alpha Canis Minoris): The brightest star in Canis Minor, a binary system with a white main-sequence star and a white dwarf companion, located about 11.4 light-years away, with a magnitude of 0.34. \n\n Gomeisa (Beta Canis Minoris): A hot, blue-white star located approximately 162 light-years away, with a magnitude of 2.89.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 2485: A barred spiral galaxy located about 50 million light-years away, visible with mid-sized telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Canis Minor.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Canis Minor is easy to locate due to Procyon, its brightest star, which is part of the Winter Triangle along with Betelgeuse (Orion) and Sirius (Canis Major). Look to the southeast during winter evenings for Procyon, which appears as a bright white star. Canis Minor’s stars form a small, simple line in the night sky. A star chart or app can assist in identifying it.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Canis Minor’s Procyon is a key star for understanding binary systems and stellar evolution due to its white dwarf companion. Its proximity to Earth makes it an excellent target for studying stellar properties and nearby space. Though small, the constellation contributes to our understanding of nearby stars and galaxies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Canis%20Minor.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Capricornus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Capricornus, the \"Sea Goat,\" is a zodiac constellation located in the Southern Hemisphere. It is best observed during late summer and fall (August to October). It is bordered by Aquarius, Sagittarius, and Microscopium. Capricornus spans 414 square degrees, ranking it 40th in size among the 88 constellations. It is visible at latitudes between +60° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Capricornus is one of the oldest constellations, associated with the sea goat from Babylonian mythology. In Greek mythology, it represents the goat-god Pan, who transformed into a sea goat to escape the monster Typhon. Capricornus has also been a symbol of resilience and duality in various cultures.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Deneb Algedi (Delta Capricorni): The brightest star in Capricornus, a white giant star located about 39 light-years away, with a magnitude of 2.87. \n\n Nashira (Gamma Capricorni): A white giant star located approximately 139 light-years away, with a magnitude of 3.69. \n\n Algedi (Alpha Capricorni): A double star system with components visible to the naked eye.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 30 (M30): A globular cluster located about 27,000 light-years away, visible with binoculars or small telescopes. \n\n The Capricornus Void: A region of space with a low density of galaxies, providing insights into cosmic voids.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Alpha Capricornids: A minor meteor shower peaking in late July and early August. \n\n Observation Tips: The meteors are bright and slow-moving, making them easier to observe. Focus on the area around Capricornus’ brightest stars, such as Deneb Algedi and Nashira, after midnight under dark skies. Bring a reclining chair for comfort during extended observation.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Capricornus is faint and best located using its nearby neighbors, Sagittarius and Aquarius, as guides. Look for a faint, triangular pattern of stars in the southern sky during late summer evenings. Binoculars or small telescopes enhance views of the globular cluster M30. Use a star chart or app to confirm its position in areas with light pollution.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Capricornus’ location along the ecliptic makes it important for tracking planetary and lunar movements. Its globular cluster, Messier 30, provides valuable data on the evolution of stars in dense stellar environments. The Capricornus Void offers a unique area for studying the large-scale structure of the universe.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Capricornus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Carina",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Carina, the \"Keel,\" is a prominent constellation in the Southern Hemisphere. It is best observed during summer (December to March). It is bordered by Vela, Puppis, and Centaurus. Carina spans 494 square degrees, ranking it 34th in size among the 88 constellations. It is visible at latitudes between +20° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Carina represents the keel of the ship Argo Navis, which carried Jason and the Argonauts in their quest for the Golden Fleece. The original Argo Navis constellation was later divided into Carina (the keel), Vela (the sails), and Puppis (the stern). Its mythology ties closely to Greek seafaring legends and the voyage of discovery.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Canopus (Alpha Carinae): The second brightest star in the night sky, a yellow-white giant located approximately 310 light-years away, with a magnitude of -0.72. \n\n Miaplacidus (Beta Carinae): A blue-white subgiant located about 113 light-years away, with a magnitude of 1.68. \n\n Eta Carinae: A highly luminous and unstable binary system located about 7,500 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Eta Carinae Nebula (NGC 3372): A massive emission nebula surrounding the star Eta Carinae, visible to the naked eye under dark skies. \n\n NGC 2808: A globular cluster located about 32,000 light-years away, containing hundreds of thousands of stars. \n\n Homunculus Nebula: A bright nebula formed by Eta Carinae’s outbursts, visible in small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Carina.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Carina is one of the most visually striking constellations in the Southern Hemisphere. To locate it, look for Canopus, the second brightest star in the sky, which marks the constellation’s most prominent feature. The Eta Carinae Nebula can be spotted with binoculars as a hazy patch, while a small telescope reveals intricate details of the Homunculus Nebula. The best time to observe Carina is during summer evenings.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Carina hosts Eta Carinae, one of the most massive and luminous stellar systems known, making it a key object for studying stellar evolution and supernova precursors. The Eta Carinae Nebula is also one of the most active regions of star formation in the Milky Way. Canopus, a navigational star, has been used for centuries in sea and space exploration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Carina.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Cassiopeia",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Cassiopeia, the \"Seated Queen,\" is a prominent constellation in the Northern Hemisphere. It is best observed during autumn and winter evenings (September to February). It is bordered by Andromeda, Perseus, and Cepheus. Cassiopeia spans 598 square degrees, ranking it 25th in size among the 88 constellations. It is visible at latitudes between +90° and -20°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Cassiopeia represents the vain queen of Ethiopia in Greek mythology, who boasted about her beauty. Her arrogance angered Poseidon, leading to her daughter Andromeda being chained to a rock as a sacrifice. The gods placed Cassiopeia in the sky, seated on her throne, as a reminder of her vanity.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Schedar (Alpha Cassiopeiae): An orange giant located about 228 light-years away, with a magnitude of 2.24. \n\n Caph (Beta Cassiopeiae): A yellow-white giant located approximately 54.5 light-years away, with a magnitude of 2.28. \n\n Ruchbah (Delta Cassiopeiae): A binary star system located about 99 light-years away, with a magnitude of 2.68.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 52 (M52): An open cluster located approximately 5,000 light-years away, visible with binoculars. \n\n The Heart and Soul Nebulae (IC 1805 and IC 1848): Massive emission nebulae located about 7,500 light-years away. \n\n Cassiopeia A: A supernova remnant located about 11,000 light-years away, studied extensively for its role in stellar death and supernova remnants.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Cassiopeia.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Cassiopeia is easy to locate due to its distinctive \"W\" shape, formed by five bright stars. It is visible year-round in the Northern Hemisphere, circling around Polaris. Use a star chart to explore its rich star fields and nebulae along the Milky Way. Binoculars or small telescopes are ideal for viewing deep-sky objects like the Heart and Soul Nebulae and M52.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Cassiopeia lies along the plane of the Milky Way, making it rich in deep-sky objects. Cassiopeia A, a supernova remnant, is a key target for understanding the life cycles of massive stars. Its star clusters and nebulae are important for studying stellar formation and evolution. The constellation also serves as a reliable navigation marker for locating Polaris.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Cassiopeia.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Centaurus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Centaurus, the \"Centaur,\" is a prominent Southern Hemisphere constellation. It is best observed during late autumn and winter (April to June). It is bordered by Hydra, Lupus, and Crux. Centaurus spans 1,060 square degrees, ranking it 9th in size among the 88 constellations. It is visible at latitudes between +30° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Centaurus represents the centaur Chiron, a wise and noble creature from Greek mythology who taught heroes like Achilles and Jason. Unlike other centaurs, Chiron was kind and intelligent. After his death, Zeus placed him in the sky to honor his wisdom and kindness.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Centauri: The closest star system to Earth, located 4.37 light-years away, consisting of three stars: Alpha Centauri A, Alpha Centauri B, and Proxima Centauri. \n\n Beta Centauri (Hadar): A blue giant located about 390 light-years away, with a magnitude of 0.61. \n\n Theta Centauri (Menkent): An orange giant located 60 light-years away, with a magnitude of 2.06.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Omega Centauri (NGC 5139): The largest globular cluster in the Milky Way, located about 15,800 light-years away, visible to the naked eye as a hazy spot. \n\n Centaurus A (NGC 5128): A lenticular galaxy located about 12 million light-years away, notable for its massive black hole and active radio emissions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Centaurus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Centaurus is one of the most recognizable constellations in the Southern Hemisphere. To locate it, find the Southern Cross (Crux), then look to the east for the bright stars Alpha and Beta Centauri. Use binoculars or a small telescope to view Omega Centauri and the galaxy Centaurus A, both prominent deep-sky objects. The best time to observe Centaurus is during late autumn evenings.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Centaurus is home to Alpha Centauri, the closest star system to Earth, which has been extensively studied for its potential to host exoplanets. Omega Centauri is crucial for understanding globular cluster dynamics and stellar evolution. Centaurus A is a key galaxy for studying black holes and radio galaxies, making the constellation vital for both amateur and professional astronomers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Centaurus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Cepheus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Cepheus, the \"King,\" is a circumpolar constellation in the Northern Hemisphere, meaning it is visible year-round from mid-northern latitudes. It is best observed during fall evenings (September to November). It is bordered by Cassiopeia, Draco, and Ursa Minor. Cepheus spans 588 square degrees, ranking it 27th in size among the 88 constellations. It is visible at latitudes between +90° and -10°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Cepheus represents the mythological king of Ethiopia and husband of Cassiopeia. In Greek mythology, he is the father of Andromeda, who was rescued by Perseus from the sea monster Cetus. The constellation is part of the Perseus family of constellations, closely linked to the story of Andromeda's rescue.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alderamin (Alpha Cephei): The brightest star in Cepheus, a white subgiant located about 49 light-years away, with a magnitude of 2.45. \n\n Alfirk (Beta Cephei): A blue giant star located approximately 600 light-years away, with a magnitude of 3.23. \n\n Errai (Gamma Cephei): An orange giant located about 45 light-years away, known for its exoplanetary system.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 7023 (Iris Nebula): A bright reflection nebula located about 1,300 light-years away. \n\n NGC 188: One of the oldest open star clusters, located approximately 5,000 light-years away. \n\n NGC 6946 (Fireworks Galaxy): A spiral galaxy located about 22 million light-years away, known for its high rate of supernova activity.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Cepheus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Cepheus is easy to locate near Cassiopeia and Polaris, the North Star. Its shape resembles a simple house with a pointed roof. Use binoculars or small telescopes to observe its notable deep-sky objects, like the Iris Nebula and the Fireworks Galaxy. Cepheus’ circumpolar position makes it visible year-round, but its best viewing period is in the fall.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Cepheus hosts several notable stars, such as Gamma Cephei, which was one of the first stars discovered to have an exoplanet. The constellation’s deep-sky objects, like the Iris Nebula and the Fireworks Galaxy, are valuable for studying star formation and galactic activity. Cepheus’ circumpolar nature makes it a reliable guide for navigation and sky observation.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Cepheus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Cetus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Cetus, the \"Sea Monster,\" is a large constellation in the equatorial region. It is best observed during late fall and early winter evenings (October to January). It is bordered by Aries, Pisces, and Taurus. Cetus spans 1,231 square degrees, making it the 4th largest constellation. It is visible at latitudes between +70° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Cetus represents the sea monster from Greek mythology that was sent by Poseidon to punish Queen Cassiopeia. Andromeda was offered as a sacrifice to Cetus, but she was saved by Perseus. The constellation symbolizes the monstrous power of the sea and is part of the story of Perseus and Andromeda.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Mira (Omicron Ceti): A pulsating red giant star located approximately 300 light-years away, known as one of the first variable stars discovered. Its magnitude varies between 2 and 10 over a period of about 11 months. \n\n Deneb Kaitos (Beta Ceti): A yellow giant star located about 96 light-years away, with a magnitude of 2.04.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "M77: A barred spiral galaxy located about 47 million light-years away, visible with small telescopes. \n\n NGC 1055: An edge-on spiral galaxy located about 52 million light-years away, often observed alongside M77. \n\n NGC 246 (Skull Nebula): A planetary nebula located approximately 1,600 light-years away, visible with small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Cetus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Cetus is located near Aries and Pisces in the southeastern sky during late fall evenings. Look for its brightest star, Deneb Kaitos, as a starting point. Use binoculars or a small telescope to observe Mira when it is near its maximum brightness or deep-sky objects like M77 and the Skull Nebula. Its large size makes Cetus an excellent constellation to explore over multiple nights.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Cetus contains Mira, a variable star that has been crucial for studying pulsating stars and stellar evolution. The barred spiral galaxy M77 is a key target for studying active galactic nuclei. Cetus’ position along the celestial equator makes it an accessible target for observers in both hemispheres.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Cetus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Chamaeleon",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Chamaeleon, the \"Chameleon,\" is a small constellation in the Southern Hemisphere. It is best observed during late autumn and winter (April to June). It is bordered by Carina, Musca, and Octans. Chamaeleon spans 132 square degrees, ranking it 79th in size among the 88 constellations. It is visible at latitudes between +20° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Chamaeleon was introduced by Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents the chameleon, an exotic lizard found in the southern regions explored during the Age of Discovery. The constellation has no roots in ancient mythology and reflects the fascination with nature during the Renaissance.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Chamaeleontis: A white subgiant star located about 64 light-years away, with a magnitude of 4.06. \n\n Gamma Chamaeleontis: A red giant star located approximately 413 light-years away, with a magnitude of 4.11.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Chamaeleon I Cloud Complex: One of the closest star-forming regions, located about 520 light-years away. \n\n IC 2631: A bright reflection nebula associated with the Chamaeleon I region, visible with small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Chamaeleon.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Chamaeleon is best observed in dark skies in the Southern Hemisphere. To locate it, use the nearby constellations Carina and Musca as guides. The Chamaeleon I Cloud Complex can be observed with small telescopes as a faint, diffuse region, while Alpha and Gamma Chamaeleontis are easy to spot with the naked eye under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Chamaeleon I is a significant region for studying star formation, as it is one of the closest active star-forming regions to Earth. Its nebulae and protostars provide key insights into the early stages of stellar evolution. Despite its small size, the constellation is a critical area for exploring the structure and dynamics of molecular clouds.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Chamaeleon.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Circinus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Circinus, the \"Compass,\" is a small constellation in the Southern Hemisphere. It is best observed during late winter and spring (May to July). It is bordered by Centaurus, Lupus, and Triangulum Australe. Circinus spans 93 square degrees, ranking it 85th in size among the 88 constellations. It is visible at latitudes between +30° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Circinus was introduced by French astronomer Nicolas-Louis de Lacaille in the 18th century. It represents a drafting compass used in geometry and navigation, reflecting the tools and instruments celebrated during the Enlightenment. Unlike many constellations, Circinus has no roots in ancient mythology.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Circini: The brightest star in Circinus, a yellow-white dwarf located approximately 54 light-years away, with a magnitude of 3.19. \n\n Gamma Circini: A binary star system located about 380 light-years away, with a combined magnitude of 4.51.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Circinus Galaxy (ESO 97-G13): A Seyfert galaxy located about 13 million light-years away, known for its active nucleus. \n\n Circinus X-1: A neutron star binary system, an important target for studying X-ray emissions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Circinus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Circinus is faint but lies near the prominent constellation Centaurus. To locate it, use Alpha Centauri as a guide and look slightly to the south. Binoculars or a small telescope are required to observe its notable objects, such as the Circinus Galaxy and the X-ray binary Circinus X-1. The best viewing conditions occur in dark skies during late spring.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Circinus is home to the Circinus Galaxy, an active galaxy that provides insights into the processes occurring in galactic nuclei. Circinus X-1 is a valuable object for studying neutron stars and X-ray emissions. Despite its small size, the constellation plays a key role in advancing our understanding of high-energy astrophysics.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Circinus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Columba",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Columba, the \"Dove,\" is a small constellation in the Southern Hemisphere. It is best observed during summer and early fall (January to March). It is bordered by Canis Major, Lepus, Pictor, and Puppis. Columba spans 270 square degrees, ranking it 54th in size among the 88 constellations. It is visible at latitudes between +45° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Columba was introduced by Dutch astronomers Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents the dove that brought an olive branch to Noah after the biblical flood. Columba symbolizes peace and hope, and its stars are believed to have guided sailors navigating southern seas during the Age of Exploration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Phact (Alpha Columbae): The brightest star in Columba, a blue-white subgiant located about 261 light-years away, with a magnitude of 2.65. \n\n Wezn (Beta Columbae): A yellow-white giant star located approximately 86 light-years away, with a magnitude of 3.12.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 1851: A globular cluster located about 39,000 light-years away, visible with small telescopes. \n\n NGC 1792: A spiral galaxy located approximately 36 million light-years away, known for its star-forming regions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Columba.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Columba is easy to locate near Canis Major, below the bright star Sirius in the southern sky during summer evenings. Its brightest stars, Phact and Wezn, form a distinctive line. Use binoculars or a small telescope to observe its globular cluster NGC 1851 and spiral galaxy NGC 1792. The best viewing time is in January and February under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Columba contains NGC 1851, a globular cluster studied for its unique properties and potential binary stars. Its position near Canis Major makes it an excellent target for exploring southern deep-sky objects. The constellation’s association with navigation highlights its historical importance during maritime exploration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Columba.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Coma Berenices",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Coma Berenices, the \"Hair of Berenice,\" is a small constellation in the Northern Hemisphere. It is best observed during spring evenings (March to May). It is bordered by Virgo, Leo, and Canes Venatici. Coma Berenices spans 386 square degrees, ranking it 42nd in size among the 88 constellations. It is visible at latitudes between +90° and -70°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Coma Berenices represents the hair of Queen Berenice II of Egypt, who sacrificed her locks to the gods for her husband’s safe return from war. The constellation’s name and story originate from Greek and Egyptian mythology, symbolizing devotion and sacrifice.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Diadem (Alpha Comae Berenices): The brightest star in Coma Berenices, a binary star system located about 63 light-years away, with a magnitude of 4.32. \n\n Beta Comae Berenices: A yellow main-sequence star located approximately 29.78 light-years away, with a magnitude of 4.23.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Coma Cluster: A nearby open star cluster located about 280 light-years away, visible to the naked eye as a hazy patch. \n\n Virgo Cluster: A massive cluster of galaxies located approximately 54 million light-years away, partially overlapping with Coma Berenices. \n\n NGC 4565 (Needle Galaxy): An edge-on spiral galaxy located about 40 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Coma Berenices.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Coma Berenices is faint but can be located near Virgo and Leo in the spring sky. Its open cluster, the Coma Cluster, appears as a hazy region visible to the naked eye under dark skies. Use binoculars or a telescope to explore the Needle Galaxy and galaxies in the Virgo Cluster. The best viewing period is from March to May during clear nights.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Coma Berenices contains the Coma Cluster, which is crucial for studying star cluster dynamics and nearby galaxies. Its portion of the Virgo Cluster is significant for understanding large-scale structures in the universe. The constellation’s Needle Galaxy is a prime example of a spiral galaxy viewed edge-on, making it a favorite for astrophotography and galactic research.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Coma%20Berenices.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Camelopardalis",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Camelopardalis, the \"Giraffe,\" is a large but faint constellation in the Northern Hemisphere. It is best observed during winter evenings (December to February). It is bordered by Draco, Ursa Major, Cassiopeia, and Perseus. Camelopardalis spans 757 square degrees, ranking it 18th in size among the 88 constellations. It is visible at latitudes between +90° and -10°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Camelopardalis derives its name from the Greek words for camel and leopard, referring to its resemblance to a giraffe. It was introduced by Dutch astronomer Petrus Plancius in the late 16th century. The constellation has no connections to ancient mythology but was created to fill an area of the sky lacking prominent stars.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Beta Camelopardalis: A yellow supergiant star located about 1,000 light-years away, with a magnitude of 4.03. \n\n CS Camelopardalis: A binary system featuring a massive, hot blue star and a companion, located about 3,000 light-years away. \n\n Alpha Camelopardalis: A hot, luminous O-type star located approximately 6,000 light-years away, with a magnitude of 4.3.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 2403: A spiral galaxy located about 8 million light-years away, part of the M81 Group. \n\n IC 342: A face-on spiral galaxy located approximately 10 million light-years away, often called the \"Hidden Galaxy\" due to its position near the Milky Way's plane. \n\n NGC 1502: A small open cluster containing about 45 stars, located approximately 3,000 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Camelopardalis.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Camelopardalis is faint and requires dark skies to observe. Locate it by using nearby Ursa Major and Cassiopeia as references. The constellation stretches between these two prominent constellations in the northern sky. Binoculars or a small telescope will enhance views of its deep-sky objects, especially the galaxies NGC 2403 and IC 342.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Camelopardalis contains several intriguing deep-sky objects, such as NGC 2403 and IC 342, which are valuable for studying galactic structure and star formation. Its open cluster NGC 1502 provides insights into stellar evolution. Though faint, the constellation plays a role in mapping the northern sky during astronomical surveys.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Camelopardalis.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Crater",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Crater, the \"Cup,\" is a small constellation in the Southern Hemisphere. It is best observed during spring (March to May). It is bordered by Virgo, Hydra, and Corvus. Crater spans 282 square degrees, ranking it 53rd in size among the 88 constellations. It is visible at latitudes between +65° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Crater represents the cup of Apollo in Greek mythology. According to legend, a crow (Corvus) was sent by Apollo to fetch water but delayed its task. The cup and the crow were placed in the sky as part of a group with Hydra to serve as a reminder of the crow’s disobedience.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Delta Crateris: The brightest star in Crater, an orange giant located approximately 195 light-years away, with a magnitude of 3.56. \n\n Gamma Crateris: A binary star system located about 84 light-years away, with a combined magnitude of 4.08.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 3887: A barred spiral galaxy located about 70 million light-years away, visible with mid-sized telescopes. \n\n NGC 3511 and NGC 3513: A pair of interacting galaxies located approximately 45 million light-years away, visible in larger telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Crater.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Crater is located near Hydra and Corvus in the southern sky. Look for its semicircular arrangement of stars, resembling a cup, to the west of Virgo’s bright star Spica. Use binoculars or a small telescope to observe its faint galaxies like NGC 3887. The best viewing conditions occur in April under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Crater’s galaxies, such as NGC 3887 and the interacting pair NGC 3511/3513, are important for studying the dynamics of barred spiral galaxies and galactic interactions. Despite its faint stars, the constellation holds significance in mythology and is part of a group with Corvus and Hydra in Greek lore.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Crater.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Crux",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Crux, the \"Southern Cross,\" is a small but prominent constellation in the Southern Hemisphere. It is best observed during autumn and winter (March to June). It is bordered by Centaurus and Musca. Crux spans 68 square degrees, ranking it 88th in size, making it the smallest constellation. It is visible at latitudes between +20° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Crux has been a cultural symbol in many societies, often associated with navigation and spirituality. For indigenous Australian groups, it represents an emu in the sky, while in European cultures, it has been connected with the Christian cross. Its bright stars and shape have made it a key feature in southern star lore and exploration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Acrux (Alpha Crucis): The brightest star in Crux, a triple star system located about 320 light-years away, with a combined magnitude of 0.76. \n\n Gacrux (Gamma Crucis): A red giant star located approximately 88 light-years away, with a magnitude of 1.59. \n\n Delta Crucis: A blue-white subgiant star located about 360 light-years away, with a magnitude of 2.79.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "The Coalsack Nebula: A dark nebula located about 600 light-years away, easily visible to the naked eye. \n\n Jewel Box Cluster (NGC 4755): A bright open cluster located about 6,440 light-years away, visible in small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Crux.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Crux is easy to locate due to its iconic cross shape and proximity to the bright stars of Centaurus. Look for the Southern Cross high in the southern sky during late autumn. Binoculars or small telescopes will enhance views of the Jewel Box Cluster, and the Coalsack Nebula is visible to the naked eye under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Crux is vital for navigation in the Southern Hemisphere due to its proximity to the South Celestial Pole. The Jewel Box Cluster is a rich field for studying young stars, and the Coalsack Nebula provides insights into interstellar dust and molecular clouds. Its cultural and historical significance makes it one of the most recognized constellations worldwide.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Crux.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Corvus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Corvus, the \"Crow,\" is a small constellation in the Southern Hemisphere. It is best observed during spring and early summer (April to June). It is bordered by Virgo, Hydra, and Crater. Corvus spans 184 square degrees, ranking it 70th in size among the 88 constellations. It is visible at latitudes between +60° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Corvus represents a crow or raven in Greek mythology. According to legend, the bird was sent by Apollo to fetch water but delayed its task and lied about it. In punishment, Apollo placed the crow in the sky along with a cup (Crater) and a serpent (Hydra). The constellation is part of the mythological grouping of Corvus, Crater, and Hydra.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Gienah (Gamma Corvi): The brightest star in Corvus, a blue giant located about 165 light-years away, with a magnitude of 2.59. \n\n Kraz (Beta Corvi): A yellow giant star located approximately 146 light-years away, with a magnitude of 2.65.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 4038/4039 (Antennae Galaxies): A pair of interacting galaxies located about 60 million light-years away, known for their long tidal tails. \n\n NGC 4361: A planetary nebula located about 4,300 light-years away, resembling a faint elliptical disk in small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Corvus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Corvus is easy to locate near the bright constellation Virgo, close to the star Spica. Its quadrilateral shape stands out in the southern sky during spring evenings. Binoculars or small telescopes are recommended for observing the Antennae Galaxies and NGC 4361. The best viewing conditions occur from April to June under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Corvus is home to the Antennae Galaxies, a famous pair of interacting galaxies studied for insights into galactic collisions and star formation. The planetary nebula NGC 4361 provides valuable data on the late stages of stellar evolution. Corvus’ mythology and compact shape make it a unique feature of the Southern Hemisphere sky.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Corvus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Cygnus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Cygnus, the \"Swan,\" is a prominent constellation in the Northern Hemisphere. It is best observed during summer and early autumn (June to October). It is bordered by Lyra, Draco, Pegasus, and Vulpecula. Cygnus spans 804 square degrees, ranking it 16th in size among the 88 constellations. It is visible at latitudes between +90° and -40°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Cygnus represents a swan in Greek mythology and is often associated with the story of Zeus transforming into a swan to seduce Leda. In another legend, it symbolizes Orpheus, who was transformed into a swan and placed in the sky after his death. The constellation is also connected to the myth of Phaethon, whose friend Cycnus mourned his loss and was turned into a swan.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Deneb (Alpha Cygni): The brightest star in Cygnus and one of the vertices of the Summer Triangle. Deneb is a blue-white supergiant located about 2,600 light-years away, with a magnitude of 1.25. \n\n Albireo (Beta Cygni): A famous binary star system known for its contrasting golden and blue components, located about 430 light-years away. \n\n Gienah Cygni (Epsilon Cygni): An orange giant located approximately 72 light-years away, with a magnitude of 2.48.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "North America Nebula (NGC 7000): A massive emission nebula located about 1,600 light-years away, resembling the shape of the North American continent. \n\n Cygnus Loop (Veil Nebula): A supernova remnant located about 2,400 light-years away, visible with telescopes and in astrophotography. \n\n Pelican Nebula (IC 5070): A bright nebula near Deneb, located approximately 2,000 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "| Meteor Showers | The October Cygnids: A minor meteor shower peaking in early October, with rates of about 5 meteors per hour. Best viewed after midnight during its peak. Look for meteors radiating near the constellation's brightest star, Deneb. Allow your eyes to adjust to the dark for optimal results. Source: The October Cygnids are believed to originate from the long-period Comet C/1911 N1 (Kiess). No meteor storms are associated with this shower. |",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Cygnus is easy to locate due to its cross-shaped pattern, often referred to as the \"Northern Cross.\" Look for Deneb in the northeastern sky during summer evenings; it forms one of the vertices of the Summer Triangle along with Vega and Altair. Binoculars or small telescopes can enhance views of its rich star fields, the North America Nebula, and the Veil Nebula. The best time to observe Cygnus is during summer under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Cygnus contains Deneb, one of the brightest and most luminous stars in the galaxy, which plays a key role in studying stellar evolution. Its location along the Milky Way makes it a hotspot for observing star clusters, nebulae, and supernova remnants. The Veil Nebula, a supernova remnant, provides insights into the life cycle of massive stars and their explosive deaths.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Cygnus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Delphinus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Delphinus, the \"Dolphin,\" is a small but distinctive constellation in the Northern Hemisphere. It is best observed during late summer and early autumn (August to October). It is bordered by Aquila, Pegasus, Equuleus, and Vulpecula. Delphinus spans 189 square degrees, ranking it 69th in size among the 88 constellations. It is visible at latitudes between +90° and -70°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Delphinus represents a dolphin in Greek mythology and is associated with several myths. In one story, it is the dolphin that saved the poet Arion from drowning and carried him to safety. In another, it symbolizes the dolphin that persuaded Amphitrite, the sea goddess, to marry Poseidon. The constellation’s graceful, curved shape evokes the playful and helpful nature of the dolphin.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Sualocin (Alpha Delphini): The brightest star in Delphinus, a binary star system located about 240 light-years away, with a magnitude of 3.77. \n\n Rotanev (Beta Delphini): A binary star system located approximately 98 light-years away, with a magnitude of 3.63.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 6891: A planetary nebula located about 7,200 light-years away, visible with mid-sized telescopes. \n\n NGC 6905 (Blue Flash Nebula): A planetary nebula located approximately 4,500 light-years away, notable for its vivid blue color in telescopic images. \n\n NGC 6934: A globular cluster located about 50,000 light-years away, visible with small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Delphinus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Delphinus is small but easy to locate due to its distinctive \"diamond\" or \"kite\" shape. Look for it to the northeast of the bright star Altair in Aquila during late summer evenings. Its brightest stars, Sualocin and Rotanev, are close together and form the head of the dolphin. Binoculars or a small telescope can enhance views of its planetary nebulae and globular cluster.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Delphinus is notable for its planetary nebulae, such as the Blue Flash Nebula, which provides insights into the late stages of stellar evolution. Its star systems, including Sualocin and Rotanev, are useful for studying binary dynamics. The constellation’s compact size and unique shape make it a favorite for stargazers and amateur astronomers alike.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Delphinus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Dorado",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Dorado, the \"Swordfish,\" is a Southern Hemisphere constellation. It is best observed during summer (December to February). It is bordered by Reticulum, Hydrus, and Volans. Dorado spans 179 square degrees, ranking it 72nd in size among the 88 constellations. It is visible at latitudes between +20° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Dorado was introduced by Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents the swordfish, a marine animal encountered during their voyages. The constellation was named to reflect the flora and fauna of the southern seas discovered during the Age of Exploration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Doradus: The brightest star in Dorado, a binary system located about 175 light-years away, with a magnitude of 3.27. \n\n Beta Doradus: A yellow giant star located approximately 1,050 light-years away, known for its variability.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Large Magellanic Cloud (LMC): A satellite galaxy of the Milky Way, located about 163,000 light-years away, containing numerous star clusters and nebulae. \n\n Tarantula Nebula (NGC 2070): A massive emission nebula in the LMC, visible with small telescopes. \n\n NGC 1850: A dense star cluster located in the LMC.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Dorado.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Dorado is best viewed under dark skies in the Southern Hemisphere. Its defining feature is the Large Magellanic Cloud, which appears as a bright patch in the sky. Use binoculars or a telescope to explore the Tarantula Nebula and star clusters within the LMC. The best time to observe Dorado is during summer evenings from December to February.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Dorado is home to the Large Magellanic Cloud, a key object for studying galactic dynamics, star formation, and stellar evolution. The Tarantula Nebula is one of the largest star-forming regions in the nearby universe. The constellation offers a rich field of exploration for professional and amateur astronomers alike.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Dorado.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Draco",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Draco, the \"Dragon,\" is a large circumpolar constellation in the Northern Hemisphere. It is visible year-round and best observed during summer evenings (June to August). It is bordered by Ursa Major, Cepheus, Lyra, and Hercules. Draco spans 1,083 square degrees, ranking it 8th in size among the 88 constellations. It is visible at latitudes between +90° and -15°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Draco represents Ladon, the dragon in Greek mythology that guarded the golden apples of the Hesperides. It was placed in the sky by Hera to honor its service. The constellation has also been associated with dragons in other cultures, symbolizing power, protection, and celestial guardianship.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Eltanin (Gamma Draconis): The brightest star in Draco, an orange giant located approximately 154 light-years away, with a magnitude of 2.23. \n\n Thuban (Alpha Draconis): A historical pole star around 3000 BCE, located approximately 303 light-years away, with a magnitude of 3.67. \n\n Rastaban (Beta Draconis): A yellow giant star located about 380 light-years away, with a magnitude of 2.79.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 6543 (Cat’s Eye Nebula): A planetary nebula located about 3,000 light-years away, notable for its intricate structure. \n\n Draco Dwarf Galaxy: A satellite galaxy of the Milky Way, located approximately 260,000 light-years away. \n\n Abell 2218: A massive galaxy cluster located about 2 billion light-years away, used for gravitational lensing studies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Draconids: A minor meteor shower peaking in early October. \n\n Observation Tips: Best viewed after dusk, as the radiant is highest in the evening. Look for meteors radiating from the head of the dragon near Eltanin. Patience and dark skies are essential for viewing.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Draco’s long, winding shape snakes between the Big Dipper (Ursa Major) and the Little Dipper (Ursa Minor). Look for its brightest stars, Eltanin and Rastaban, which form the dragon’s head. Use binoculars or a small telescope to observe its deep-sky objects, like the Cat’s Eye Nebula. Draco is visible year-round but is best seen in the summer.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Draco’s Thuban, a historical pole star, offers insights into Earth’s axial precession. The constellation’s deep-sky objects, such as the Cat’s Eye Nebula and the Draco Dwarf Galaxy, are important for studying stellar evolution and dark matter. Its unique mythology and circumpolar position make it a favorite among stargazers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Draco.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Equuleus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Equuleus, the \"Little Horse,\" is a small and faint constellation in the Northern Hemisphere. It is best observed during late summer and early autumn (August to October). It is bordered by Aquarius, Pegasus, and Delphinus. Equuleus spans 72 square degrees, ranking it 87th in size among the 88 constellations. It is visible at latitudes between +90° and -80°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Equuleus represents the foal Celeris, a gift from Mercury to Castor in Greek mythology. Celeris was the brother or offspring of the winged horse Pegasus. The constellation is sometimes seen as a companion to Pegasus, sharing its connection to horses and speed.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Kitalpha (Alpha Equulei): The brightest star in Equuleus, a binary star system located about 186 light-years away, with a magnitude of 3.92. \n\n Delta Equulei: A spectroscopic binary star system located approximately 60 light-years away, with a magnitude of 4.49.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "There are no prominent deep-sky objects associated with Equuleus due to its faintness and lack of notable features.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Equuleus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Equuleus is small and faint, requiring dark skies and a star chart to locate. Look for it near the western edge of Pegasus and Delphinus during late summer evenings. Its brightest star, Kitalpha, serves as a helpful reference point. Binoculars or a small telescope can assist in observing its faint stars and double systems like Delta Equulei.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Despite its small size and faintness, Equuleus offers insights into binary star systems, particularly Kitalpha and Delta Equulei. Its connection to Pegasus and its mythological symbolism as the \"Little Horse\" add to its cultural and astronomical significance.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Equuleus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Eridanus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Eridanus, the \"River,\" is a long and winding constellation in the Southern Hemisphere. It is best observed during late autumn and winter (November to February). It is bordered by Taurus, Cetus, and Orion. Eridanus spans 1,138 square degrees, ranking it 6th in size among the 88 constellations. It is visible at latitudes between +32° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Eridanus represents a river from Greek mythology, often associated with the Nile or the Po River. It is also linked to the myth of Phaethon, who drove the Sun’s chariot recklessly and was struck down by Zeus. Phaethon’s body fell into the river Eridanus, which was placed in the sky to honor him.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Achernar (Alpha Eridani): The brightest star in Eridanus, a blue giant located about 144 light-years away, with a magnitude of 0.46. \n\n Cursa (Beta Eridani): A blue-white star located approximately 89 light-years away, with a magnitude of 2.79. \n\n Epsilon Eridani: A sun-like star located about 10.5 light-years away, notable for its nearby exoplanetary system.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 1300: A barred spiral galaxy located about 61 million light-years away, visible in large telescopes. \n\n NGC 1535: A planetary nebula located approximately 1,500 light-years away, known for its bright central star. \n\n Epsilon Eridani System: A nearby stellar system with an exoplanet, making it a target for studying planetary formation.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Eridanus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Eridanus is one of the longest constellations, extending from Orion in the northern sky to Achernar in the far southern sky. To locate it, start near Orion’s Rigel and follow its stars southward. Its best viewing period is during November through February under dark skies. Use binoculars or a telescope to observe its planetary nebulae and galaxies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Eridanus is home to Achernar, one of the brightest stars in the night sky, and Epsilon Eridani, a nearby star system of interest for exoplanet research. Its planetary nebulae and galaxies, such as NGC 1300, provide valuable insights into stellar and galactic evolution. The constellation’s size and mythological significance make it a fascinating target for stargazers and astronomers alike.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Eridanus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Fornax",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Fornax, the \"Furnace,\" is a small constellation in the Southern Hemisphere. It is best observed during late autumn and winter (November to February). It is bordered by Eridanus, Cetus, and Phoenix. Fornax spans 398 square degrees, ranking it 41st in size among the 88 constellations. It is visible at latitudes between +50° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Fornax was introduced by French astronomer Nicolas-Louis de Lacaille in the 18th century. It represents a furnace, symbolizing the scientific and technological advancements of the Enlightenment era. Unlike many constellations, Fornax has no roots in ancient mythology and reflects Lacaille’s focus on naming constellations after instruments and tools.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Fornacis: The brightest star in Fornax, a yellow-white subgiant located approximately 46 light-years away, with a magnitude of 3.85. \n\n Beta Fornacis: A giant star located about 169 light-years away, with a magnitude of 4.46.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Fornax Cluster: A galaxy cluster located about 62 million light-years away, containing numerous elliptical and spiral galaxies. \n\n NGC 1365: A barred spiral galaxy in the Fornax Cluster, notable for its well-defined structure and active galactic nucleus. \n\n Fornax Dwarf Galaxy: A satellite galaxy of the Milky Way, located about 460,000 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Fornax.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Fornax is faint and best observed under dark skies in the Southern Hemisphere. To locate it, use Eridanus and Phoenix as reference points. The Fornax Cluster and NGC 1365 can be observed with mid-sized telescopes, while binoculars can help identify some of its brighter stars. The best viewing period is from November to February.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Fornax hosts the Fornax Cluster, a key region for studying galaxy evolution and interactions. NGC 1365’s active nucleus makes it a prime target for investigating supermassive black holes. The Fornax Dwarf Galaxy is significant for understanding the dynamics of the Local Group of galaxies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Fornax.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Gemini",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Gemini, the \"Twins,\" is a prominent zodiac constellation in the Northern Hemisphere. It is best observed during winter (December to March). It is bordered by Orion, Taurus, Cancer, and Auriga. Gemini spans 514 square degrees, ranking it 30th in size among the 88 constellations. It is visible at latitudes between +90° and -60°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Gemini represents the twin brothers Castor and Pollux from Greek mythology. They were the sons of Zeus and Leda and are associated with loyalty and brotherhood. Castor was mortal, while Pollux was immortal, and they were placed in the sky by Zeus to honor their bond. The constellation is often seen as a symbol of duality and companionship.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Pollux (Beta Geminorum): The brightest star in Gemini, an orange giant located about 34 light-years away, with a magnitude of 1.14. \n\n Castor (Alpha Geminorum): A multiple star system located approximately 51 light-years away, with a combined magnitude of 1.93. \n\n Alhena (Gamma Geminorum): A blue-white star located about 109 light-years away, with a magnitude of 1.93.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 35 (M35): An open cluster located about 2,800 light-years away, visible with binoculars. \n\n Eskimo Nebula (NGC 2392): A planetary nebula located approximately 2,870 light-years away, known for its detailed structure resembling a face surrounded by a parka hood. \n\n NGC 2129: A small open cluster located about 7,200 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Geminids: A major meteor shower peaking in mid-December. \n\n Observation Tips: Best viewed after midnight during its peak, with the radiant near the bright star Castor. Dark skies and patience are essential for observing this high-rate meteor shower.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Gemini is easy to locate due to its two brightest stars, Pollux and Castor, which form the heads of the twins. Look for the constellation in the northeastern sky during winter evenings. Binoculars or small telescopes can enhance views of its deep-sky objects, such as M35 and the Eskimo Nebula. The best time to observe Gemini is from December to March.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Gemini’s stars, particularly Pollux and Castor, are key targets for studying stellar dynamics and evolution. Its position along the zodiac makes it significant for tracking planetary movements. The Geminids meteor shower is one of the most active annual showers, providing a spectacular observational highlight for astronomers and stargazers alike.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Gemini.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Grus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Grus, the \"Crane,\" is a constellation in the Southern Hemisphere. It is best observed during late summer and autumn (August to November). It is bordered by Piscis Austrinus, Microscopium, and Phoenix. Grus spans 366 square degrees, ranking it 45th in size among the 88 constellations. It is visible at latitudes between +34° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Grus was introduced by Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents the crane, a bird often associated with grace, balance, and longevity in various cultures. The constellation reflects the natural world encountered during the explorers’ voyages in the Southern Hemisphere.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alnair (Alpha Gruis): The brightest star in Grus, a blue-white main-sequence star located about 101 light-years away, with a magnitude of 1.74. \n\n Beta Gruis: A red giant star located approximately 170 light-years away, with a magnitude of 2.13.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 7424: A barred spiral galaxy located about 37.5 million light-years away, known for its well-defined spiral arms. \n\n IC 1459: An elliptical galaxy located approximately 85 million light-years away, notable for its active galactic nucleus. \n\n NGC 7213: A Seyfert galaxy located about 71 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Grus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Grus is best observed in the Southern Hemisphere during the late summer and autumn months. Look for its brightest star, Alnair, as a starting point. Its elongated shape and bright stars make it relatively easy to identify in dark skies. Use binoculars or small telescopes to observe its galaxies like NGC 7424 and IC 1459.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Grus is home to several galaxies, including NGC 7424 and IC 1459, which are valuable for studying galactic dynamics and black holes. Its bright stars, such as Alnair and Beta Gruis, are key targets for understanding stellar properties. The constellation’s position in the Southern Hemisphere sky makes it an important feature for observers in that region.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Grus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Hercules",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Hercules, the \"Hero,\" is a large constellation in the Northern Hemisphere. It is best observed during summer evenings (May to August). It is bordered by Lyra, Draco, and Ophiuchus. Hercules spans 1,225 square degrees, ranking it 5th in size among the 88 constellations. It is visible at latitudes between +90° and -50°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Hercules represents the hero from Greek mythology known for his twelve labors. The constellation is sometimes depicted as Hercules kneeling, holding a club and a lion skin. It has been associated with bravery, strength, and resilience in various cultures throughout history.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Rasalgethi (Alpha Herculis): A red giant star located approximately 360 light-years away, with a magnitude of 3.06. \n\n Kornephoros (Beta Herculis): A yellow giant star located about 139 light-years away, with a magnitude of 2.81.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 13 (M13): The Great Hercules Globular Cluster, located about 22,200 light-years away, visible with the naked eye in dark skies. \n\n Messier 92 (M92): A globular cluster located about 26,700 light-years away, slightly smaller than M13. \n\n Abell 2151 (Hercules Cluster): A cluster of galaxies located about 500 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Hercules.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Hercules is most recognizable for its Keystone asterism, a quadrilateral of stars forming the hero’s torso. Look for it high in the eastern sky during summer evenings. The Great Hercules Globular Cluster (M13) is a must-see target, visible with binoculars or small telescopes. The best time to observe Hercules is from May to August under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Hercules contains two prominent globular clusters, M13 and M92, which are key targets for studying the structure and dynamics of these dense stellar systems. The Hercules Cluster of galaxies provides insights into large-scale structures in the universe. The constellation’s mythology and prominent position in the Northern Hemisphere make it a favorite among stargazers and astronomers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Hercules.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Horologium",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Horologium, the \"Clock,\" is a small constellation in the Southern Hemisphere. It is best observed during late autumn and winter (November to January). It is bordered by Eridanus, Hydrus, and Reticulum. Horologium spans 249 square degrees, ranking it 58th in size among the 88 constellations. It is visible at latitudes between +30° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Horologium was introduced by French astronomer Nicolas-Louis de Lacaille in the 18th century. It represents a clock, specifically a pendulum clock, highlighting the scientific advancements of the Enlightenment. Like many of Lacaille’s constellations, Horologium reflects tools and instruments rather than mythological figures.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Horologii: The brightest star in Horologium, an orange giant located about 117 light-years away, with a magnitude of 3.85. \n\n Beta Horologii: A blue-white star located approximately 312 light-years away, with a magnitude of 5.02.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Horologium-Reticulum Supercluster: A massive supercluster of galaxies located hundreds of millions of light-years away. \n\n NGC 1261: A globular cluster located approximately 53,000 light-years away, visible with small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Horologium.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Horologium is faint and best observed under dark skies in the Southern Hemisphere. Use Eridanus and Hydrus as guides to locate it. The globular cluster NGC 1261 can be observed with binoculars or small telescopes. The best time to view Horologium is during November to January.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Horologium contains the Horologium-Reticulum Supercluster, a key structure for studying the distribution of galaxies and dark matter. The globular cluster NGC 1261 provides insights into the dynamics and evolution of stellar systems. Despite its faintness, Horologium holds significance for its contributions to astronomical research.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Horologium.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Hydra",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Hydra, the \"Sea Serpent,\" is the largest constellation in the night sky. It is best observed during spring (March to May). It is bordered by Cancer, Leo, Virgo, Libra, and Crater. Hydra spans 1,303 square degrees, ranking it 1st in size among the 88 constellations. It is visible at latitudes between +54° and -83°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Hydra represents the multi-headed serpent from Greek mythology that Hercules fought during his twelve labors. Each time Hercules cut off one of Hydra’s heads, two more would grow back, symbolizing resilience and challenge. In the sky, it is often depicted as a long, winding snake.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alphard (Alpha Hydrae): The brightest star in Hydra, an orange giant located about 177 light-years away, with a magnitude of 2.00. \n\n Zeta Hydrae: A yellow giant star located approximately 167 light-years away, with a magnitude of 3.10.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 48 (M48): An open cluster located about 1,500 light-years away, visible with binoculars. \n\n NGC 3242 (Ghost of Jupiter Nebula): A planetary nebula located about 1,400 light-years away, visible in small telescopes. \n\n Hydra Cluster: A galaxy cluster located about 190 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Hydra.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Hydra is best identified by its brightest star, Alphard, located near the center of the constellation. The long, winding shape of Hydra spans across much of the southern sky in spring. Use binoculars or small telescopes to observe its deep-sky objects, such as the Ghost of Jupiter Nebula and the Hydra Cluster.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Hydra’s vast size includes numerous deep-sky objects, such as star clusters and nebulae, making it a rich area for observational astronomy. The Hydra Cluster provides insights into galaxy formation and large-scale cosmic structures. The constellation’s mythological and celestial prominence make it a fascinating target for stargazers and researchers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Hydra.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Hydrus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Hydrus, the \"Water Snake,\" is a small constellation in the Southern Hemisphere. It is best observed during late autumn and winter (November to February). It is bordered by Tucana, Reticulum, and Dorado. Hydrus spans 243 square degrees, ranking it 61st in size among the 88 constellations. It is visible at latitudes between +8° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Hydrus was introduced by Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents a water snake and was named after the creatures encountered during their voyages. Unlike Hydra, Hydrus has no roots in ancient mythology and is often seen as its smaller Southern Hemisphere counterpart.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Beta Hydri: The brightest star in Hydrus, a yellow subgiant located about 24 light-years away, with a magnitude of 2.80. \n\n Gamma Hydri: An orange giant located approximately 214 light-years away, with a magnitude of 3.24.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 1466: A globular cluster located about 160,000 light-years away, part of the Large Magellanic Cloud. \n\n IC 1717: A faint galaxy located approximately 130 million light-years away, observable with larger telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Hydrus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Hydrus is faint and best observed in the Southern Hemisphere under dark skies. Look for it near Tucana and the Large Magellanic Cloud. Its brightest star, Beta Hydri, is an excellent starting point for locating the constellation. Use binoculars or a telescope to observe its globular cluster NGC 1466.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Hydrus is home to Beta Hydri, one of the closest stars to the Sun and an important target for studying stellar evolution. Its proximity to the Large Magellanic Cloud makes it a valuable region for observing deep-sky objects and understanding galactic interactions. Despite its small size, Hydrus is significant for its astronomical and navigational role.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Hydrus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Indus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Indus, the \"Indian,\" is a faint constellation in the Southern Hemisphere. It is best observed during spring and summer (September to December). It is bordered by Grus, Tucana, and Pavo. Indus spans 294 square degrees, ranking it 49th in size among the 88 constellations. It is visible at latitudes between +15° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Indus was introduced by Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman in the late 16th century. It represents a native figure from the lands they explored during their voyages. The constellation reflects the fascination with diverse cultures and peoples during the Age of Exploration.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Indi: The brightest star in Indus, an orange giant located about 98 light-years away, with a magnitude of 3.11. \n\n Beta Indi: A red giant located approximately 600 light-years away, with a magnitude of 3.66.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "IC 5152: A dwarf irregular galaxy located about 5.8 million light-years away, part of the Local Group. \n\n NGC 7049: A lenticular galaxy located approximately 100 million light-years away, known for its striking dust lane.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Indus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Indus is faint and requires dark skies for observation. Use its brightest star, Alpha Indi, as a reference point and look for its location near Grus and Pavo. Binoculars or telescopes are needed to observe its faint galaxies, such as IC 5152. The best viewing period for Indus is during September through December in the Southern Hemisphere.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Indus is part of the Local Group of galaxies, with IC 5152 providing insights into the structure and evolution of dwarf galaxies. Its position in the Southern Hemisphere makes it a fascinating constellation for studying the distribution of stars and galaxies in this region of the sky. Its historical connections to exploration add cultural significance.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Indus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Lacerta",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Lacerta, the \"Lizard,\" is a small constellation in the Northern Hemisphere. It is best observed during autumn evenings (September to November). It is bordered by Cygnus, Pegasus, and Andromeda. Lacerta spans 201 square degrees, ranking it 68th in size among the 88 constellations. It is visible at latitudes between +90° and -40°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Lacerta was introduced by Polish astronomer Johannes Hevelius in 1687. It does not have any connections to ancient mythology and was named for its lizard-like pattern. The constellation was created to fill a gap in the sky between prominent constellations such as Cygnus and Pegasus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Lacertae: The brightest star in Lacerta, a blue-white main-sequence star located about 102 light-years away, with a magnitude of 3.77. \n\n Beta Lacertae: A yellow giant star located approximately 170 light-years away, with a magnitude of 4.42.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 7243: An open cluster located about 2,800 light-years away, visible with binoculars or small telescopes. \n\n BL Lacertae: A blazar located about 900 million light-years away, notable for its variable brightness and intense emissions.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Lacerta.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Lacerta is faint but can be located between Cygnus and Pegasus. Its zigzag pattern of stars resembles a lizard. The open cluster NGC 7243 is an excellent target for binoculars or small telescopes. Autumn evenings are the best time to observe this constellation under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Lacerta is notable for the blazar BL Lacertae, which is an important object for studying active galactic nuclei and relativistic jets. Its open cluster NGC 7243 is a key target for studying young star groupings. Although small and faint, Lacerta’s location along the Milky Way makes it rich in faint stars and deep-sky objects.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Lacerta.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Leo",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Leo, the \"Lion,\" is a prominent zodiac constellation in the Northern Hemisphere. It is best observed during spring (March to May). It is bordered by Virgo, Cancer, and Ursa Major. Leo spans 947 square degrees, ranking it 12th in size among the 88 constellations. It is visible at latitudes between +90° and -65°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Leo represents the Nemean Lion, a beast slain by Hercules during his twelve labors. In Greek mythology, the lion’s impenetrable skin made it invulnerable to weapons, and Hercules defeated it by strangulation. The constellation has been associated with lions in other cultures, symbolizing strength and bravery.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Regulus (Alpha Leonis): The brightest star in Leo, a blue-white main-sequence star located about 79 light-years away, with a magnitude of 1.35. \n\n Denebola (Beta Leonis): A white main-sequence star located approximately 36 light-years away, with a magnitude of 2.14. \n\n Algieba (Gamma Leonis): A binary star system located about 126 light-years away, with a combined magnitude of 2.37.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 65 (M65): A spiral galaxy located about 35 million light-years away, part of the Leo Triplet. \n\n Messier 66 (M66): A barred spiral galaxy located approximately 36 million light-years away, also part of the Leo Triplet. \n\n NGC 3628: A third galaxy in the Leo Triplet, notable for its tidal tails.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Leonids: A major meteor shower peaking in mid-November. \n\n Observation Tips: Best viewed after midnight during its peak. Look for meteors radiating near the sickle-shaped asterism marking the lion’s head. Find a dark location for optimal viewing.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Leo is easy to locate due to its sickle-shaped asterism, representing the lion’s mane, and its bright star Regulus. Look for the constellation in the eastern sky during spring evenings. Binoculars or small telescopes can enhance views of the Leo Triplet galaxies. The best time to observe Leo is during March and April under clear skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Leo contains Regulus, a key star for studying rotational velocity in stars. The Leo Triplet galaxies provide valuable insights into galactic interactions and dynamics. Its position along the zodiac makes it an important constellation for tracking planetary movements. The Leonids meteor shower is a highlight for astronomers and stargazers alike.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Leo.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Leo Minor",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Leo Minor, the \"Little Lion,\" is a small constellation in the Northern Hemisphere. It is best observed during spring (March to May). It is bordered by Leo, Lynx, and Ursa Major. Leo Minor spans 232 square degrees, ranking it 64th in size among the 88 constellations. It is visible at latitudes between +90° and -45°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Leo Minor was introduced by Polish astronomer Johannes Hevelius in the late 17th century. It does not have connections to ancient mythology and was named for its position near Leo, the larger lion. The constellation symbolizes a smaller, less prominent companion to the majestic Leo.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "46 Leonis Minoris: The brightest star in Leo Minor, an orange giant located about 95 light-years away, with a magnitude of 3.83. \n\n Beta Leonis Minoris: A binary star system located approximately 145 light-years away, with a combined magnitude of 4.21.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 3432: An edge-on spiral galaxy located about 42 million light-years away, visible with medium-sized telescopes. \n\n Hanny’s Voorwerp: A rare and unusual light echo from a quasar, located near NGC 3432 and visible in astrophotography.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Leo Minor.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Leo Minor is faint and requires dark skies to observe. Look for it between the bright constellations Leo and Ursa Major during spring evenings. Use binoculars or a telescope to locate its faint deep-sky objects, such as NGC 3432. The best viewing period for Leo Minor is during March and April.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Leo Minor’s galaxy NGC 3432 and its association with Hanny’s Voorwerp provide unique insights into galactic interactions and quasar activity. Although small and faint, the constellation offers significant opportunities for studying extragalactic phenomena. Its location between brighter constellations makes it a challenging yet rewarding target for astronomers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Leo%20Minor.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Lepus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Lepus, the \"Hare,\" is a small constellation in the Southern Hemisphere. It is best observed during winter (December to February). It is bordered by Orion, Eridanus, and Columba. Lepus spans 290 square degrees, ranking it 51st in size among the 88 constellations. It is visible at latitudes between +63° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Lepus represents a hare in Greek mythology, often associated with the hunter Orion, who is depicted as chasing it in the sky. In some stories, Lepus symbolizes swiftness and cleverness, traits commonly attributed to hares. The constellation is seen as crouching beneath Orion’s feet.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Arneb (Alpha Leporis): The brightest star in Lepus, a yellow-white supergiant located about 2,200 light-years away, with a magnitude of 2.58. \n\n Nihal (Beta Leporis): A yellow giant star located approximately 159 light-years away, with a magnitude of 2.84.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 79 (M79): A globular cluster located about 42,000 light-years away, visible with binoculars or small telescopes. \n\n Hind’s Crimson Star (R Leporis): A variable red giant star located about 1,360 light-years away, known for its deep red color.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Lepus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Lepus is easy to find beneath Orion’s feet in the southern sky during winter evenings. Its brightest stars, Arneb and Nihal, form a distinct shape resembling a crouching hare. Binoculars or small telescopes can enhance views of the globular cluster M79 and Hind’s Crimson Star. The best time to observe Lepus is from December to February under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Lepus contains M79, a fascinating globular cluster located in an unusual position far from the galactic core. Hind’s Crimson Star is a popular target for amateur astronomers due to its intense red color and variability. The constellation’s proximity to Orion makes it a notable feature of the winter sky.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Lepus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Libra",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Libra, the \"Scales,\" is a zodiac constellation in the Southern Hemisphere. It is best observed during spring (April to June). It is bordered by Virgo, Scorpius, and Hydra. Libra spans 538 square degrees, ranking it 29th in size among the 88 constellations. It is visible at latitudes between +65° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Libra represents the scales of justice in Roman mythology and is associated with the goddess Astraea, the personification of justice. The constellation is unique among the zodiac signs as the only one representing an inanimate object. It has also been linked to balance and fairness in various cultures.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Zubenelgenubi (Alpha Librae): A binary star system located about 77 light-years away, with a combined magnitude of 2.75. \n\n Zubeneschamali (Beta Librae): A greenish-blue star located approximately 185 light-years away, with a magnitude of 2.61. \n\n Gamma Librae: An orange giant star located about 152 light-years away, with a magnitude of 3.91.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 5897: A globular cluster located about 40,000 light-years away, visible with small telescopes.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Libra.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Libra is located near Scorpius and Virgo, with its brightest stars forming a quadrilateral shape. Look for it in the southeastern sky during spring evenings. Use binoculars or a telescope to observe its globular cluster NGC 5897. The best viewing conditions occur from April to June under dark skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Libra contains Zubenelgenubi, a binary star system often used as a calibration point for stellar measurements. Its position along the zodiac makes it significant for tracking planetary motions. Despite its modest deep-sky objects, Libra remains a prominent constellation for its cultural and symbolic importance.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Libra.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Lupus",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Lupus, the \"Wolf,\" is a constellation in the Southern Hemisphere. It is best observed during late autumn and winter (May to July). It is bordered by Centaurus, Scorpius, and Norma. Lupus spans 334 square degrees, ranking it 46th in size among the 88 constellations. It is visible at latitudes between +35° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Lupus represents a wolf or wild animal in Greek and Roman mythology. It is often depicted as a beast being hunted or sacrificed by the nearby Centaur in the sky. The constellation has also been associated with other animals in various cultures, reflecting its ambiguous and non-specific mythological origins.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Lupi: The brightest star in Lupus, a blue giant located about 460 light-years away, with a magnitude of 2.30. \n\n Beta Lupi: A blue-white star located approximately 383 light-years away, with a magnitude of 2.68.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 5986: A globular cluster located about 35,000 light-years away, visible with small telescopes. \n\n IC 4406: A planetary nebula located approximately 1,900 light-years away, known for its unique rectangular shape.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Lupus.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Lupus is located near Centaurus and Scorpius in the southern sky. Its brightest star, Alpha Lupi, can be used as a reference point for finding the constellation. Binoculars or small telescopes are ideal for viewing its deep-sky objects, such as NGC 5986 and IC 4406. The best time to observe Lupus is during May and June.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Lupus contains notable deep-sky objects, such as NGC 5986, a globular cluster rich in stellar populations. The planetary nebula IC 4406 is a key target for studying the late stages of stellar evolution. Despite its modest visibility, Lupus offers valuable opportunities for amateur and professional astronomers in the Southern Hemisphere.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Lupus.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Lynx",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Lynx, the \"Lynx,\" is a faint constellation in the Northern Hemisphere. It is best observed during spring (March to May). It is bordered by Ursa Major, Auriga, and Gemini. Lynx spans 545 square degrees, ranking it 28th in size among the 88 constellations. It is visible at latitudes between +90° and -55°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Lynx was introduced by Polish astronomer Johannes Hevelius in 1687. It was named for its faint stars, requiring sharp eyesight—like that of a lynx—to see. The constellation does not have connections to ancient mythology and was created to fill a gap in the sky.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Lyncis: The brightest star in Lynx, an orange giant located about 203 light-years away, with a magnitude of 3.14. \n\n 38 Lyncis: A binary star system located approximately 122 light-years away, with a combined magnitude of 3.82.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "NGC 2419 (Intergalactic Wanderer): A remote globular cluster located about 300,000 light-years away, visible with larger telescopes. \n\n NGC 2537 (Bear Paw Galaxy): A small irregular galaxy located about 25 million light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Lynx.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Lynx is faint and requires dark skies for observation. Look for it between the brighter constellations Ursa Major and Auriga during spring evenings. Use binoculars or a telescope to observe its deep-sky objects, such as NGC 2419 and the Bear Paw Galaxy. The best viewing period for Lynx is from March to May.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Lynx contains the Intergalactic Wanderer, one of the most remote globular clusters known, providing valuable insights into the outskirts of the Milky Way. Despite its faintness, the constellation holds significance for its deep-sky objects and its placement near more prominent constellations.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Lynx.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Lyra",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Lyra, the \"Lyre,\" is a small but prominent constellation in the Northern Hemisphere. It is best observed during summer (June to September). It is bordered by Hercules, Cygnus, and Draco. Lyra spans 286 square degrees, ranking it 52nd in size among the 88 constellations. It is visible at latitudes between +90° and -40°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Lyra represents the lyre of Orpheus, the musician from Greek mythology. After Orpheus’s death, Zeus placed his lyre in the sky to honor his musical talents. The lyre is also associated with Apollo and Hermes in various myths, symbolizing art, music, and culture.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Vega (Alpha Lyrae): The brightest star in Lyra and the fifth brightest star in the night sky, a blue-white main-sequence star located about 25 light-years away, with a magnitude of 0.03. \n\n Sheliak (Beta Lyrae): A binary star system located approximately 960 light-years away, with a combined magnitude of 3.45. \n\n Epsilon Lyrae (Double Double): A famous multiple star system, located about 162 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Messier 57 (M57, Ring Nebula): A planetary nebula located about 2,300 light-years away, known for its donut-like shape. \n\n Messier 56 (M56): A globular cluster located approximately 32,900 light-years away. \n\n NGC 6791: An open cluster located about 13,000 light-years away.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "The Lyrids: A meteor shower peaking in late April. \n\n Observation Tips: Best viewed in the pre-dawn hours during its peak. The meteors radiate near Vega, Lyra’s brightest star. Find a dark location to maximize your chances of seeing meteors.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Lyra is easy to locate due to its bright star Vega, which forms one of the vertices of the Summer Triangle. Look for it high in the northeastern sky during summer evenings. Use binoculars or small telescopes to observe the Ring Nebula and the Double Double star system. The best time to observe Lyra is from June to September under clear skies.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Lyra contains Vega, one of the most studied stars due to its proximity and brightness. The Ring Nebula is a key object for understanding planetary nebulae and stellar evolution. The Lyrids meteor shower provides an annual highlight for stargazers. Its role in mythology and its prominent position in the summer sky make Lyra a favorite for both amateur and professional astronomers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Lyra.jpg",
    "Image": ""
  },
  {
    "Constellation Name": "Mensa",
    "Paragraph Headers": "Location and Visibility",
    "Details": "Mensa, the \"Table Mountain,\" is a small and faint constellation in the Southern Hemisphere. It is best observed during late autumn and winter (November to February). It is bordered by Dorado, Hydrus, and Volans. Mensa spans 153 square degrees, ranking it 75th in size among the 88 constellations. It is visible at latitudes between +4° and -90°.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Mythological Background",
    "Details": "Mensa was introduced by French astronomer Nicolas-Louis de Lacaille in the 18th century. It is named after Table Mountain in South Africa, near Lacaille’s observatory. Unlike many constellations, Mensa has no roots in ancient mythology and reflects Lacaille’s focus on scientific exploration and natural landmarks.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Notable Stars",
    "Details": "Alpha Mensae: The brightest star in Mensa, a yellow dwarf similar to the Sun, located about 33 light-years away, with a magnitude of 5.09. \n\n Beta Mensae: A faint star located approximately 660 light-years away, with a magnitude of 5.31.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Deep-Sky Objects",
    "Details": "Large Magellanic Cloud (LMC): A nearby satellite galaxy of the Milky Way, containing numerous star clusters and nebulae. \n\n NGC 1841: A globular cluster located about 160,000 light-years away within the LMC.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Meteor Showers",
    "Details": "There are no major meteor showers associated with the constellation Mensa.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Observation Tips",
    "Details": "Mensa is faint and requires dark skies for observation. Look for it near the Large Magellanic Cloud in the Southern Hemisphere during November and February. Use binoculars or a telescope to observe the LMC’s features, including star clusters and nebulae.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Astronomical Importance",
    "Details": "Mensa contains part of the Large Magellanic Cloud, making it a significant region for studying galaxy formation and stellar evolution. Its proximity to the Magellanic Cloud makes it an important target for understanding interactions between galaxies. Despite its faintness, Mensa is valuable for both amateur and professional astronomers.",
    "Image": ""
  },
  {
    "Constellation Name": "",
    "Paragraph Headers": "Image",
    "Details": "https://raw.githubusercontent.com/BigBird7827/Constellation-Guide/refs/heads/main/Constellation%20Images/Mensa.jpg",
    "Image": ""
  }
]