[
  {
    "Introduction": "Over 4,000 exoplanets have been discovered, each one unique in its characteristics. While some resemble planets in our solar system, like Venus or Neptune, many others are unlike anything we've observed. These strange worlds are categorized with names such as hot Jupiters, super-Earths, and carbon planets, reflecting their unusual features. Identifiers like CoRoT-7b, Kepler-10c, and TRAPPIST-1a stem from star catalogs, surveys, and space observatories, but what do we really know about these distant planets orbiting other stars?\n\nThe Unified Astronomy Thesaurus currently lists 15 exoplanet categories, with additional types occasionally appearing in studies. These categories often overlap, meaning a planet may fit into more than one. Five of the classifications are based on a planet’s size, ordered from smallest to largest: rocky planets, super-Earths, mini-Neptunes, ice giants, and gas giants. Some super-Earths and mini-Neptunes may even be ocean worlds, with deep liquid-water oceans stretching for hundreds of kilometers. In carbon-rich systems, some rocky planets could become ultra-dry carbon planets, where silicon and carbon form the bulk of their geology instead of the silicon-oxygen rocks we are familiar with.\n\nCertain exoplanet types combine size and location in a system. Hot Jupiters and hot Neptunes are large, gaseous planets that orbit very close to their stars, resulting in extremely short orbital periods. Their proximity to their stars causes them to become tidally locked, with one hemisphere constantly facing the star, while the other remains in perpetual darkness. This phenomenon occurs because gravity from nearby stars stretches the planet slightly, causing it to rotate at the same rate it orbits. This is also the reason we only see one side of the Moon from Earth.\n\nBeyond these, there are cold Jupiters and cold Neptunes, which follow orbits farther from their stars, much like the gas giants in our own solar system. Lava planets are super-dense worlds that orbit extremely close to their stars, often with surface temperatures high enough to melt rock. Some of these may even be the leftover cores of hot Jupiters that have evaporated, referred to as Chthonian planets, named after the Greek underworld. Habitable planets are Earth-sized and exist in a specific region of space where liquid water could potentially exist on their surfaces, creating the possibility for life. This \"habitable zone\" varies based on the size and luminosity of the star. Smaller, dimmer stars may have habitable zones that are closer in, possibly leading to tidally locked planets.\n\nIn addition to these categories, exoplanets can also be found in more unusual orbits. Trojan planets are hypothetical smaller planets that co-orbit with larger planets, though none have been definitively observed yet. Our own solar system has Trojan asteroids, but they are too small to be considered planets. Pulsars, incredibly dense and rapidly rotating neutron stars, have their own special category for any planets that might orbit them. Finally, rogue or free-floating planets, which have been ejected from their star systems due to gravitational disturbances, travel alone through space. Although only one such planet has been discovered, scientists suspect there are many more out there.\n\nHaving explored the different classifications of exoplanets, let’s examine some well-known examples and see what types they fall into."
  }
]